Revit 2027 API
ImageExportOptions.ShouldCreateWebSite Property
 Whether or not to create a web site with a page for each export. Used only when ExportRange is SetOfViews.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShouldCreateWebSite { get; set; }
Public Property ShouldCreateWebSite As Boolean
	Get
	Set
public:
property bool ShouldCreateWebSite {
	bool get ();
	void set (bool value);
}
member ShouldCreateWebSite : bool with get, set
Property Value
Boolean
Remarks
 The default is false. This field is ignored if used to save an image to a project as a new view.
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace